
## :x: Apply Failed

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220418815)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_vendor.vendor: Reading...
pagerduty_team.pd_team["poc"]: Refreshing state... [id=PVFT88T]
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
data.pagerduty_vendor.vendor: Read complete after 0s [id=PAM4FGS]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Refreshing state... [id=POCJ4A2:PVFT88T]
data.pagerduty_users.pd_users["poc-system"]: Reading...
data.pagerduty_users.pd_users["poc-system"]: Read complete after 0s [id=1710055914]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_escalation_policy.pd_esp["poc-system"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-system"
      + num_loops   = 3
      + teams       = [
          + "PVFT88T",
        ]

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = "POCJ4A2"
              + type = "user_reference"
            }
        }
    }

  # pagerduty_service.pd_service["poc-system"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-System"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service_integration.datadog["poc-system"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-system"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
pagerduty_escalation_policy.pd_esp["poc-system"]: Creating...
pagerduty_service.pd_service["poc-system"]: Creating...
pagerduty_escalation_policy.pd_esp["poc-system"]: Creation complete after 0s [id=PD6MH3X]
╷
│ Error: POST API call to https://api.pagerduty.com/services failed 400 Bad Request. Code: 2001, Errors: [Escalation policy can't be blank], Message: Invalid Input Provided
│ 
│   with pagerduty_service.pd_service["poc-system"],
│   on pagerduty_service.tf line 1, in resource "pagerduty_service" "pd_service":
│    1: resource "pagerduty_service" "pd_service" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"f46214a7410fb217202d4f8fdb6d2d26446dd446","Vars":{},"WorkflowName":"Plan"} -->